app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date
---

    if @orderby.nil?
      if params[:ratings].nil?
        @movies = Movie.all
      else
        @movies = Movie.find(:all, :conditions => {:rating => @checked_ratings.keys})